Repository: galgaloda/smart_school_assistant
Catalog: lib/l10n/app_*.arb
Languages: am

# appTitle
source: Smart School Assistant
am: የትምህርት ቤት ረዳት

source: Select a Class
am: ክፍል ይምረጡ

# noClassesFound
source: No classes found. Tap + to add one.
am: ክፍሎች አልተገኙም። አንዱን ለመጨመር + ይጫኑ።

source: Add New Class Section
am: አዲስ ክፍል ይጨምሩ

# className
source: Class Name (e.g., Grade 7A)
am: የክፍል ስም (ለምሳሌ፡ የ7ኛ ክፍል A)

# pleaseEnterClassName
source: Please enter a class name.
am: የክፍል ስም ያስገቡ።

source: Cancel
am: ያጥሉ

source: Save
am: ያስቀምጡ

source: English
am: እንግሊዝኛ

# oromo
source: Afaan Oromoo
am: ኦሮሞ

source: Teacher Assistant
am: የአስተማሪ ረዳት

source: Timetable
am: የትምህርት መርሃ ግብር

source: Reports
am: ሪፖርቶች

source: Add New Student
am: አዲስ ተማሪ ይጨምሩ

# studentFullName
source: Student's Full Name
am: የተማሪ ሙሉ ስም

# pleaseEnterStudentName
source: Please enter the student's name.
am: የተማሪ ስም ያስገቡ።

source: Take Attendance
am: መስተካከል ያድርጉ

source: Enter Scores
am: ውጤቶችን ያስገቡ

# noStudentsFound
source: No students found in this class.
am: በዚህ ክፍል ተማሪዎች አልተገኙም።

source: Weekly Timetable
am: የሳምንት መርሃ ግብር

source: Settings
am: ቅንብሮች

source: Generate Timetable
am: መርሃ ግብር ይስጡ

# generatingTimetable
source: Generating new timetable...
am: አዲስ መርሃ ግብር በማስገን ላይ...

# timetableGenerated
source: New timetable generated!
am: አዲስ መርሃ ግብር ተሰማ!

# noPeriodsDefined
source: No periods defined. Please add periods in settings.
am: ክፍሎች አልተወሰኑም። እባክዎ በቅንብሮች ውስጥ ይጨምሩ።

source: Time
am: ጊዜ

# breakPeriod
source: Break
am: እረፍት

source: Generate Reports
am: ሪፖርቶች ይስጡ

# reportGenerationComingSoon
source: Report Generation Module - Coming Soon
am: የሪፖርት ስገና ሞዱል - በቅርቡ ይመጣል

# takeAttendanceTitle
source: Take Attendance
am: መስተካከል ያድርጉ

source: Save Attendance
am: መስተካከል ያስቀምጡ

# attendanceSaved
source: Attendance saved successfully!
am: መስተካከል በተሳካ መልክ ተሰማ!

source: Select Date
am: ቀን ይምረጡ

# present
source: P
am: አ

# absent
source: A
am: አ

# late
source: L
am: ዘ

source: Enter Student Scores
am: የተማሪ ውጤቶችን ያስገቡ

# selectStudent
source: Select a Student
am: ተማሪ ይምረጡ

# selectSubject
source: Select a Subject
am: አጋዥ ይምረጡ

source: Select Assessment Type
am: የገምገም አይነት ይምረጡ

source: Score / Marks
am: ውጤት / ምልክቶች

# pleaseEnterScore
source: Please enter a score.
am: ውጤት ያስገቡ።

# pleaseEnterValidNumber
source: Please enter a valid number.
am: ትክክለኛ ቁጥር ያስገቡ።

# scoreSaved
source: Score saved successfully!
am: ውጤት በተሳካ መልክ ተሰማ!

source: Generate Reports & Cards
am: ሪፖርቶች እና ካርዶች ይስጡ

source: Student ID Cards
am: የተማሪ መታወቂያ ካርዶች

# generatePrintableIdCards
source: Generate printable ID cards for a class.
am: ለክፍል አንድ የሚተቀለል መታወቂያ ካርዶች ይስጡ።

source: Student Report Cards
am: የተማሪ ሪፖርት ካርዶች

# generateEndOfTermReports
source: Generate end-of-term report cards for a class.
am: ለክፍል አንድ የያዘ ጊዜ ሪፖርት ካርዶች ይስጡ።

source: Student Report Card
am: የተማሪ ሪፖርት ካርድ

source: Student Name
am: የተማሪ ስም

source: Student ID
am: የተማሪ መታወቂያ

source: Class Rank
am: የክፍል ደረጃ

source: Academic Performance
am: የትምህርት አፈፃፀም

source: Subject
am: አጋዥ

source: Average Mark
am: አማካይ ምልክት

source: Your School Name
am: የትምህርት ቤት ስም

# classLabel
source: Class
am: ክፍል

source: Photo
am: ፎቶ

source: Homework
am: የቤት ሥራ

source: Quiz
am: ጥያቄ

source: Mid-term
am: አጋር ጊዜ

source: Final Exam
am: የመጨረሻ ፈተና

source: Project
am: ፕሮጀክት

source: Please fill all fields.
am: ሁሉንም መስኮች ያሙሉ።

source: Change Language
am: ቋንቋ ይለውጡ

# noSubjectsFound
source: No subjects found. Please add subjects first.
am: ምንም አጥናፎች አልተለመዱም። እባክዎ አጥናፎችን ያስገቡ።

source: Timetable Settings
am: የትምህርት መርሃ ግብር ቅንብሮች

source: Manage Teachers
am: አስተማሪዎችን ያስተያዩ

# manageTeachersDesc
source: Add or remove teachers for the schedule
am: ለመርሃ ግብር አስተማሪዎችን ያስገቡ ወይም ያስወግዱ

source: Manage Subjects
am: አጥናፎችን ያስተያዩ

# manageSubjectsDesc
source: Add subjects and assign teachers
am: አጥናፎችን ያስገቡ እና አስተማሪዎችን ያስያዙ

source: Manage Periods
am: ክፍሎችን ያስተያዩ

# managePeriodsDesc
source: Define class periods and break times
am: የክፍል ክፍሎች እና የእረፍት ጊዜያትን ያወስኑ

source: Add New Teacher
am: አዲስ አስተማሪ ያስገቡ

source: Teacher's Full Name
am: የአስተማሪ ሙሉ ስም

# pleaseEnterTeacherName
source: Please enter a teacher's name.
am: የአስተማሪ ስም ያስገቡ።

# noTeachersFound
source: No teachers found. Tap + to add one.
am: ምንም አስተማሪዎች አልተለመዱም። አንዱን ለመጨመር + ይጫኑ።

source: Add Teacher
am: አስተማሪ ያስገቡ

source: Dark Mode
am: ጨለማ ሁነታ

source: Enable dark theme
am: ጨለማ ገጽታ ያስችሉ

source: Appearance
am: መልክ

source: Language
am: ቋንቋ

# amharic
source: አማርኛ (Amharic)
am: አማርኛ

source: User Guide
am: የተጠቃሚ መሪ ሥምረት

# howToUseApp
source: How to use the app
am: አፕሊኬሽኑን እንዴት መስራት እንደሚቻል

source: App Information
am: የአፕሊኬሽን መረጃ

source: Version
am: ስሪት

source: School Name
am: የትምህርት ቤት ስም

source: Not configured
am: አልተሰየመም
